Ran Plan for 2 projects:

1. dir: `terraform/app` workspace: `default`
1. dir: `terraform/atlantis` workspace: `default`

### 1. dir: `terraform/app` workspace: `default`
```diff

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/app`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.aws.danielpetty.com/lock?id=mixmatch%252Fatlantis-demo%252Fterraform%252Fapp%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/app`

---
### 2. dir: `terraform/atlantis` workspace: `default`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.atlantis.data.aws_ecs_task_definition.atlantis will be read during apply
  # (config refers to values not yet known)
 <= data "aws_ecs_task_definition" "atlantis"  {
      + family          = (known after apply)
      + id              = (known after apply)
      + network_mode    = (known after apply)
      + revision        = (known after apply)
      + status          = (known after apply)
      + task_definition = "atlantis"
      + task_role_arn   = (known after apply)
    }

  # module.atlantis.aws_ecs_service.atlantis will be updated in-place
~ resource "aws_ecs_service" "atlantis" {
        cluster                            = "arn:aws:ecs:us-east-1:989541807172:cluster/atlantis"
        deployment_maximum_percent         = 200
        deployment_minimum_healthy_percent = 50
        desired_count                      = 1
        enable_ecs_managed_tags            = false
        health_check_grace_period_seconds  = 0
        iam_role                           = "aws-service-role"
        id                                 = "arn:aws:ecs:us-east-1:989541807172:service/atlantis"
        launch_type                        = "FARGATE"
        name                               = "atlantis"
        platform_version                   = "LATEST"
        propagate_tags                     = "NONE"
        scheduling_strategy                = "REPLICA"
        tags                               = {}
      ~ task_definition                    = "atlantis:1" -> (known after apply)

        deployment_controller {
            type = "ECS"
        }

        load_balancer {
            container_name   = "atlantis"
            container_port   = 4141
            target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:989541807172:targetgroup/atlantis/cfa6fbae7650ac4c"
        }

        network_configuration {
            assign_public_ip = false
            security_groups  = [
                "sg-09e5f6529f444a5f0",
            ]
            subnets          = [
                "subnet-059d5c295a2c5b8db",
                "subnet-05dbe55eb96ad5a1c",
                "subnet-07a82ac1f031cd975",
            ]
        }
    }

  # module.atlantis.aws_ssm_parameter.atlantis_github_user_token[0] will be updated in-place
~ resource "aws_ssm_parameter" "atlantis_github_user_token" {
        arn     = "arn:aws:ssm:us-east-1:989541807172:parameter/atlantis/github/user/token"
        id      = "/atlantis/github/user/token"
        key_id  = "alias/aws/ssm"
        name    = "/atlantis/github/user/token"
        tags    = {}
        tier    = "Standard"
        type    = "SecureString"
      ~ value   = (sensitive value)
        version = 2
    }

Plan: 0 to add, 2 to change, 0 to destroy.

Warning: Quoted type constraints are deprecated

  on .terraform/modules/atlantis.container_definition_bitbucket/cloudposse-terraform-aws-ecs-container-definition-3c43926/variables.tf line 2, in variable "container_name":
   2:   type        = "string"

Terraform 0.11 and earlier required type constraints to be given in quotes,
but that form is now deprecated and will be removed in a future version of
Terraform. To silence this warning, remove the quotes around "string".

(and 39 more similar warnings elsewhere)


Warning: "condition.0.values": [DEPRECATED] use 'host_header' or 'path_pattern' attribute instead

  on .terraform/modules/atlantis/terraform-aws-modules-terraform-aws-atlantis-e1242e3/main.tf line 213, in resource "aws_lb_listener_rule" "redirect_http_to_https":
 213: resource "aws_lb_listener_rule" "redirect_http_to_https" {



Warning: "condition.0.field": [DEPRECATED] use 'host_header' or 'path_pattern' attribute instead

  on .terraform/modules/atlantis/terraform-aws-modules-terraform-aws-atlantis-e1242e3/main.tf line 213, in resource "aws_lb_listener_rule" "redirect_http_to_https":
 213: resource "aws_lb_listener_rule" "redirect_http_to_https" {



```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/atlantis`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.aws.danielpetty.com/lock?id=mixmatch%252Fatlantis-demo%252Fterraform%252Fatlantis%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/atlantis`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
